/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   error.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: troxanna <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/20 19:48:11 by troxanna          #+#    #+#             */
/*   Updated: 2021/04/20 19:48:40 by troxanna         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../includes/minirt.h"

void	ft_error(int id_err)
{
	if (id_err == 1)
		perror("Ошибка malloc");
	else if (id_err == 2)
		perror("Ошибка парсера");
	else if (id_err == 3)
		perror("Ошибка чтения файла");
	exit(EXIT_FAILURE);
}
